#+TITLE: Protein Secondary Structure Prediction
#+LATEX_CLASS_OPTIONS: [a4paper,twocolumn]
#+LATEX_HEADER: \hypersetup{colorlinks=true,linkcolor=black, citecolor=gray}
#+OPTIONS: ^:nil toc:nil
#+AUTHOR: Francesco Codice'
#+LATEX: \numberwithin{equation}{section}
\abstract{}
\textbf{Motivation:} Protein secondary structures are locally stabilized
three-dimensional segments of proteins chains. The availability of reliable in
silico models to predict secondary structures can provide information about the
function and can be useful in the prediction of the tertiary structure.\\
\textbf{Methods:}: The GOR
method approach will be employed first and then a non linear SVM classifier will be tested.\\
\textbf{Results:}: As expected the GOR method obtains an overall Q3 accuracy of 0.62 on
the blind-set. The SVM reach 0.69 of Q3 accuracy on the blind set.\\
\textbf{Contact:} \href{francesco.codice3@studio.unibo.com}{francesco.codice3@studio.unibo.com}\\
** Cross Validation Test
As described in /Methods/ on the training-set a 5-fold crossvalidation has been
performed; during that phase a grid-search on SVM hyperparameters has been done.
The best hyperparameters selected are /gamma/ equal to 0.5 and $C$ equal to 2.
The complete gridsearch results can be found in the appendix of the article.

As we can see in /Table 2/  the GOR method as expected reach an overall Q3 accuracy of 0.62. The
/GOR/ method is pretty stable for each iteration of the crossvalidation.

#+CAPTION: Results of the GOR Method in 5-fold crossvalidation
#+ATTR_LATEX: :align p{0.8cm}p{0.5cm}p{0.5cm}p{0.5cm}p{0.5cm}p{0.5cm}ll
| Helix                |  CV1 |  CV2 |  CV3 |  CV4 |  CV5 | Avg              |
|----------------------+------+------+------+------+------+------------------|
| $MCC_H$              | 0.52 | 0.53 | 0.52 | 0.54 | 0.52 | $0.52 \pm$ 0.004 |
| $PPV_H$              | 0.62 | 0.64 | 0.64 | 0.63 | 0.61 | $0.63 \pm$ 0.004 |
| $TPR_H$              | 0.82 | 0.80 | 0.79 | 0.82 | 0.81 | $0.81 \pm$ 0.007 |
|                      |      |      |      |      |      |                  |
| Strand               |  CV1 |  CV2 |  CV3 |  CV4 |  CV5 | Avg              |
|----------------------+------+------+------+------+------+------------------|
| $MCC_E$              | 0.44 | 0.42 | 0.44 | 0.45 | 0.45 | $0.44 \pm$ 0.006 |
| $PPV_E$              | 0.50 | 0.45 | 0.47 | 0.49 | 0.51 | $0.49 \pm$ 0.010 |
| $TPR_E$              | 0.69 | 0.70 | 0.72 | 0.73 | 0.70 | $0.71 \pm$ 0.008 |
|                      |      |      |      |      |      |                  |
| Coil                 |  CV1 |  CV2 |  CV3 |  CV4 |  CV5 | Avg              |
|----------------------+------+------+------+------+------+------------------|
| $PPV_C$              | 0.41 | 0.42 | 0.42 | 0.42 | 0.42 | $0.42 \pm$ 0.002 |
| $MCC_C$              | 0.80 | 0.81 | 0.80 | 0.82 | 0.81 | $0.81 \pm$ 0.004 |
| $TPR_C$              | 0.42 | 0.43 | 0.44 | 0.41 | 0.43 | $0.43 \pm$ 0.006 |
|                      |      |      |      |      |      |                  |
|----------------------+------+------+------+------+------+------------------|
| $Q3$                 | 0.62 | 0.62 | 0.62 | 0.63 | 0.63 | $0.62 \pm$ 0.002 |
#+TBLFM: @2$7..@4$7=vsdev($2..$5)/sqrt(5);f3
#+TBLFM: @7$7..@9$7=vsdev($2..$5)/sqrt(5);f3
#+TBLFM: @12$7..@14$7=vsdev($2..$5)/sqrt(5);f3
#+TBLFM: @16$7=vsdev($2..$5)/sqrt(5);f3

 The SVM models finding the best separating hyperplane is better than the GOR
method in modeling this complex inference. The amino acid propensity used by the
GOR method is indeed an oversimplification that does not model the actual
complexity of the relationship between the sequence profile context and the
secondary structure conformation. Support vector machines model are able to take
into account more information to compute the predictions.

The SVM model performances are reported in /Table 3/ , the model selected by
grid-search obtains good performances in terms of MCC on each conformation and
an overall Q3 accuracy of /0.71/.


#+CAPTION: Results of the SVM rbf with gamma=0.5 and C=2 in 5-fold crossvalidation
\hspace{-3cm}
#+ATTR_LATEX: :align p{0.8cm}p{0.5cm}p{0.5cm}p{0.5cm}p{0.5cm}p{0.5cm}ll
#+ATTR_LaTeX: :width 6cm
#+CAPTION: Results of the SVM model (rbf with gamma=0.5 and C=2) in 5-fold crossvalidation
| Helix   |  CV1 |  CV2 |  CV3 |  CV4 |  CV5 | Avg              |
|---------+------+------+------+------+------+------------------|
| $MCC_H$ | 0.64 | 0.64 | 0.70 | 0.66 | 0.68 | $0.66 \pm$ 0.013 |
| $PPV_H$ | 0.83 | 0.86 | 0.85 | 0.85 | 0.84 | $0.85 \pm$ 0.006 |
| $TPR_H$ | 0.67 | 0.67 | 0.65 | 0.70 | 0.72 | $0.69 \pm$ 0.009 |
|         |      |      |      |      |      |                  |
| Strand  |  CV1 |  CV2 |  CV3 |  CV4 |  CV5 | Avg              |
|---------+------+------+------+------+------+------------------|
| $MCC_E$ | 0.50 | 0.48 | 0.39 | 0.49 | 0.48 | $0.50 \pm$ 0.023 |
| $PPV_E$ | 0.80 | 0.76 | 0.81 | 0.81 | 0.80 | $0.79 \pm$ 0.011 |
| $TPR_E$ | 0.42 | 0.40 | 0.49 | 0.39 | 0.41 | $0.41 \pm$ 0.020 |
|         |      |      |      |      |      |                  |
| Coil    |  CV1 |  CV2 |  CV3 |  CV4 |  CV5 | Avg              |
|---------+------+------+------+------+------+------------------|
| $MCC_C$ | 0.48 | 0.49 | 0.49 | 0.49 | 0.50 | $0.49 \pm$ 0.002  |
| $PPV_C$ | 0.61 | 0.62 | 0.62 | 0.62 | 0.63 | $0.63 \pm$ 0.002 |
| $TPR_C$ | 0.87 | 0.88 | 0.88 | 0.88 | 0.88 | $0.88 \pm$ 0.002 |
|         |      |      |      |      |      |                  |
|---------+------+------+------+------+------+------------------|
| $Q3$    | 0.70 | 0.71 | 0.71 | 0.71 | 0.71 | $0.71 \pm$ 0.002 |
|         |      |      |      |      |      |                  |
#+TBLFM: @2$7..@4$7=vsdev($2..$5)/sqrt(5);f3
#+TBLFM: @2$7..@4$7= ( vmean($2..$5));f2f2
#+TBLFM: @7$7..@9$7=vsdev($2..$5)/sqrt(5);f3
#+TBLFM: @7$7..@9$7= ( vmean($2..$5));f2f2
#+TBLFM: @12$7..@14$7=vsdev($2..$5)/sqrt(5);f3
#+TBLFM: @12$7..@14$7= ( vmean($2..$5));f2f2
#+TBLFM: @16$7=vsdev($2..$5)/sqrt(5);f3
#+TBLFM: @16$7= ( vmean($2..$5));f2f2

